In [1]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
%matplotlib inline
import matplotlib 
matplotlib.rcParams["figure.figsize"] = (20,10)

In [2]:
df=pd.read_csv("file1.csv")
df.head()

   Unnamed: 0                  location  total_sqft  bath   price  bhk
0           0  Electronic City Phase II      1056.0   2.0   39.07    2
1           1          Chikka Tirupathi      2600.0   5.0  120.00    4
2           2               Uttarahalli      1440.0   2.0   62.00    3
3           3        Lingadheeranahalli      1521.0   3.0   95.00    3
4           4                  Kothanur      1200.0   2.0   51.00    2

In [3]:
df.dropna(inplace=True)
df.isna().sum()

Unnamed: 0    0
location      0
total_sqft    0
bath          0
price         0
bhk           0
dtype: int64

In [4]:
df["price_per"]=df["price"]*100000/df.total_sqft
df.head()

,Unnamed: 0,location,total_sqft,bath,price,bhk,price_per
0,0,Electronic City Phase II,1056.0,2.0,39.07,2,3699.810606
1,1,Chikka Tirupathi,2600.0,5.0,120.00,4,4615.384615
2,2,Uttarahalli,1440.0,2.0,62.00,3,4305.555556
3,3,Lingadheeranahalli,1521.0,3.0,95.00,3,6245.890861
4,4,Kothanur,1200.0,2.0,51.00,2,4250.000000

In [5]:
len(df.location.unique())

1298

In [6]:
df.shape

(13257, 7)

In [7]:
df.location=df.location.apply(lambda x :x.strip())

location_stat=df.groupby("location")["location"].agg("count").sort_values(ascending=False)
location_stat

location
Whitefield               538
Sarjapur  Road           397
Electronic City          304
Kanakpura Road           271
Thanisandra              236
                        ...
1 Giri Nagar               1
Kanakapura Road,           1
Kanakapura main  Road      1
Kannur                     1
whitefiled                 1
Name: location, Length: 1287, dtype: int64

In [8]:
len(location_stat[location_stat<=10])

1047

In [9]:
location_stats_less_than_10 = location_stat[location_stat<=10]
location_stats_less_than_10

location
Sadashiva Nagar          10
Naganathapura            10
Basapura                 10
Nagadevanahalli          10
Kalkere                  10
                         ..
1 Giri Nagar              1
Kanakapura Road,          1
Kanakapura main  Road     1
Kannur                    1
whitefiled                1
Name: location, Length: 1047, dtype: int64

In [10]:
df.location=df.location.apply(lambda x: "other" if x in location_stats_less_than_10 else x)
len(df.location.unique())

241

In [11]:
df.head(10)

,Unnamed: 0,location,total_sqft,bath,price,bhk,price_per
0,0,Electronic City Phase II,1056.0,2.0,39.07,2,3699.810606
1,1,Chikka Tirupathi,2600.0,5.0,120.00,4,4615.384615
2,2,Uttarahalli,1440.0,2.0,62.00,3,4305.555556
3,3,Lingadheeranahalli,1521.0,3.0,95.00,3,6245.890861
4,4,Kothanur,1200.0,2.0,51.00,2,4250.000000
5,5,Whitefield,1170.0,2.0,38.00,2,3247.863248
6,6,Old Airport Road,2732.0,4.0,204.00,4,7467.057101
7,7,Rajaji Nagar,3300.0,4.0,600.00,4,18181.818182
8,8,Marathahalli,1310.0,3.0,63.25,3,4828.244275
9,9,other,1020.0,6.0,370.00,6,36274.509804

In [12]:
df.to_csv("file2.csv")